Revit 2027 API
Parameter.GetUnitTypeId Method
Gets the identifier of the unit quantifying the parameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetUnitTypeId()
Public Function GetUnitTypeId As ForgeTypeId
public:
ForgeTypeId^ GetUnitTypeId()
member GetUnitTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
Identifier of the unit of the parameter.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if this parameter is not of value type.
Remarks
The property only applies to parameters of value types.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace